Revit 2027 API
PanelScheduleView.CreateInstanceView(Document, ElementId) Method
 Creates a new instance of this view (using default template)
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PanelScheduleView CreateInstanceView(
	Document ADoc,
	ElementId panelId
)
Public Shared Function CreateInstanceView (
	ADoc As Document,
	panelId As ElementId
) As PanelScheduleView
public:
static PanelScheduleView^ CreateInstanceView(
	Document^ ADoc,
	ElementId^ panelId
)
static member CreateInstanceView :
        ADoc : Document *
        panelId : ElementId -> PanelScheduleView
Parameters
ADoc Document
 The Document
panelId ElementId
 Element id of the electrical panel element.
Return Value
PanelScheduleView
 The PanelScheduleView
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Example
// Create a new panel schedule and switch to that view
public void CreatePanelSchedule(UIDocument uiDocument)
{
    Document doc = uiDocument.Document;
    Reference selected = uiDocument.Selection.PickObject(ObjectType.Element, "Select an electrical panel");
    Element panel = doc.GetElement(selected);
    if (null != panel)
    {
        PanelScheduleView psv = null;
        using (Transaction trans = new Transaction(doc, "Create a new panel schedule"))
        {
            trans.Start();
            psv = PanelScheduleView.CreateInstanceView(doc, panel.Id);
            trans.Commit();
        }
        if (null != psv)
        {
            uiDocument.ActiveView = psv;    // make new view the active view
        }
        else
        {
            TaskDialog.Show("Revit", "Please select one electrical panel.");
        }
    }
}
See Also
Reference
PanelScheduleView Class
CreateInstanceView Overload
Autodesk.Revit.DB.Electrical Namespace